# Análisis de datos sobre el Titanic

### 1.preparacion de datos

la fuente de datos es un csv sobre el titanic y viene desde la [url](https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv)

## librerias

In [23]:
import numpy as np
import pandas as pd

## carga de datos

In [24]:
titanic=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## diccionario de variables (features y columnas)

In [25]:
df=titanic.copy()

In [26]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Nombre|Descripción |tipo de dato |clasificación de dato |tratamiento |
|---|--- |---- |--- |--- |
|``PassengerId``|  identificador único del pasajero. |int | indice| |
|``Survived``| si el pasajero sobrevivió al naufragio, codificada como 0 (no) y 1 (si). | int|binary or bool | |
|``Pclass``| clase a la que pertenecía el pasajero: 1, 2 o 3. | int| cualitativo ordinal| |
|``Name``| nombre del pasajero |str | cualitativo nominal| |
|``Sex``| sexo del pasajero. | str|binario | |
|``Age``| edad del pasajero. | float| cuantitativo discreto| |
|``SibSp``|número de hermanos, hermanas, hermanastros o hermanastras en el barco. | int|cuantitativo discreto | |
|``Parch``|número de padres e hijos en el barco.|int | cuantitativo discreto| |
|``Ticket``|  identificador del billete. |str |-- | |
|``Fare``| precio pagado por el billete. |float | cuantitavo ocntinuo | |
|``Cabin``| identificador del camarote asignado al pasajero. |str | ---| | eliminar la cabina
|``Embarked``| puerto en el que embarcó el pasajero. | str| cualitativo| |

## analisis tecnico

In [8]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [16]:
df.size

10692

In [10]:
df.isnull().sum()/len(df)*100 #hay que eliminar la cabina porque quiere decir que el 77% de los datos son perdidos

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

## valores unicos de una serie

In [15]:
for col in df:
    print(f"cantidad de unicos en la  variable{col} son {len((df[col].unique())/(len(df))*100)}") #esto es para ver la q de unicos

cantidad de unicos en la  variablePassengerId son 891
cantidad de unicos en la  variableSurvived son 2
cantidad de unicos en la  variablePclass son 3

TypeError: unsupported operand type(s) for /: 'str' and 'int'

analisis de frecuencias absolutas

In [38]:
for col in ['Survived', 'Pclass','Sex','Embarked']:
    print(df['Survived'].value_counts(normalize=True))
    print(df['Pclass'].value_counts(normalize=True))
   
    print('-----------') #el normalize hace que se quede en porcentaje si se tiene que hacer varias veces esto se debe hacer un bucle

Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64
Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64
-----------
Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64
Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64
-----------
Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64
Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64
-----------
Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64
Pclass
3    0.551066
1    0.242424
2    0.206510
Name: proportion, dtype: float64
-----------

se transforma los datos que no estan bien los valores, por ejemplo edad que estan en flotantes

In [30]:
df['Age'].describe() #el 0,42 es un dato raro que hay que solucionar, ademas el cuartil 25 no cuadra

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [33]:
df[df['Age']<1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S

In [36]:
df['Age']=df['Age'].apply(lambda row:1 if row<1 else row) #esto es para cambiar los valores que hay por debajo de 1
#con np.where se puede utilizar pero hay que hacerlo uno a uno

In [39]:
df[df['Age']==1]['Age'].replace(1,0) #esto es otra de forma de hacerlo pero el lambda es mejor, funciona mas cuando quieres reemplazar uno solo

78     0.0
164    0.0
172    0.0
183    0.0
305    0.0
381    0.0
386    0.0
469    0.0
644    0.0
755    0.0
788    0.0
803    0.0
827    0.0
831    0.0
Name: Age, dtype: float64

In [ ]:
#para comporbar si lo hemos hecho bien podemos mirar el minimo y a ver que nos sale

In [40]:
np.where(df['Age']<1,1,df['Age']) #esto tambien funciona y es mas rapido pero es "menos de progamacion"

array([22. , 38. , 26. , 35. , 35. ,  nan, 54. ,  2. , 27. , 14. ,  4. ,
       58. , 20. , 39. , 14. , 55. ,  2. ,  nan, 31. ,  nan, 35. , 34. ,
       15. , 28. ,  8. , 38. ,  nan, 19. ,  nan,  nan, 40. ,  nan,  nan,
       66. , 28. , 42. ,  nan, 21. , 18. , 14. , 40. , 27. ,  nan,  3. ,
       19. ,  nan,  nan,  nan,  nan, 18. ,  7. , 21. , 49. , 29. , 65. ,
        nan, 21. , 28.5,  5. , 11. , 22. , 38. , 45. ,  4. ,  nan,  nan,
       29. , 19. , 17. , 26. , 32. , 16. , 21. , 26. , 32. , 25. ,  nan,
        nan,  1. , 30. , 22. , 29. ,  nan, 28. , 17. , 33. , 16. ,  nan,
       23. , 24. , 29. , 20. , 46. , 26. , 59. ,  nan, 71. , 23. , 34. ,
       34. , 28. ,  nan, 21. , 33. , 37. , 28. , 21. ,  nan, 38. ,  nan,
       47. , 14.5, 22. , 20. , 17. , 21. , 70.5, 29. , 24. ,  2. , 21. ,
        nan, 32.5, 32.5, 54. , 12. ,  nan, 24. ,  nan, 45. , 33. , 20. ,
       47. , 29. , 25. , 23. , 19. , 37. , 16. , 24. ,  nan, 22. , 24. ,
       19. , 18. , 19. , 27. ,  9. , 36.5, 42. , 51. , 22. , 55.5, 40.5,
        nan, 51. , 16. , 30. ,  nan,  nan, 44. , 40. , 26. , 17. ,  1. ,
        9. ,  nan, 45. ,  nan, 28. , 61. ,  4. ,  1. , 21. , 56. , 18. ,
        nan, 50. , 30. , 36. ,  nan,  nan,  9. ,  1. ,  4. ,  nan,  nan,
       45. , 40. , 36. , 32. , 19. , 19. ,  3. , 44. , 58. ,  nan, 42. ,
        nan, 24. , 28. ,  nan, 34. , 45.5, 18. ,  2. , 32. , 26. , 16. ,
       40. , 24. , 35. , 22. , 30. ,  nan, 31. , 27. , 42. , 32. , 30. ,
       16. , 27. , 51. ,  nan, 38. , 22. , 19. , 20.5, 18. ,  nan, 35. ,
       29. , 59. ,  5. , 24. ,  nan, 44. ,  8. , 19. , 33. ,  nan,  nan,
       29. , 22. , 30. , 44. , 25. , 24. , 37. , 54. ,  nan, 29. , 62. ,
       30. , 41. , 29. ,  nan, 30. , 35. , 50. ,  nan,  3. , 52. , 40. ,
        nan, 36. , 16. , 25. , 58. , 35. ,  nan, 25. , 41. , 37. ,  nan,
       63. , 45. ,  nan,  7. , 35. , 65. , 28. , 16. , 19. ,  nan, 33. ,
       30. , 22. , 42. , 22. , 26. , 19. , 36. , 24. , 24. ,  nan, 23.5,
        2. ,  nan, 50. ,  nan,  nan, 19. ,  nan,  nan,  1. ,  nan, 17. ,
       30. , 30. , 24. , 18. , 26. , 28. , 43. , 26. , 24. , 54. , 31. ,
       40. , 22. , 27. , 30. , 22. ,  nan, 36. , 61. , 36. , 31. , 16. ,
        nan, 45.5, 38. , 16. ,  nan,  nan, 29. , 41. , 45. , 45. ,  2. ,
       24. , 28. , 25. , 36. , 24. , 40. ,  nan,  3. , 42. , 23. ,  nan,
       15. , 25. ,  nan, 28. , 22. , 38. ,  nan,  nan, 40. , 29. , 45. ,
       35. ,  nan, 30. , 60. ,  nan,  nan, 24. , 25. , 18. , 19. , 22. ,
        3. ,  nan, 22. , 27. , 20. , 19. , 42. ,  1. , 32. , 35. ,  nan,
       18. ,  1. , 36. ,  nan, 17. , 36. , 21. , 28. , 23. , 24. , 22. ,
       31. , 46. , 23. , 28. , 39. , 26. , 21. , 28. , 20. , 34. , 51. ,
        3. , 21. ,  nan,  nan,  nan, 33. ,  nan, 44. ,  nan, 34. , 18. ,
       30. , 10. ,  nan, 21. , 29. , 28. , 18. ,  nan, 28. , 19. ,  nan,
       32. , 28. ,  nan, 42. , 17. , 50. , 14. , 21. , 24. , 64. , 31. ,
       45. , 20. , 25. , 28. ,  nan,  4. , 13. , 34. ,  5. , 52. , 36. ,
        nan, 30. , 49. ,  nan, 29. , 65. ,  nan, 50. ,  nan, 48. , 34. ,
       47. , 48. ,  nan, 38. ,  nan, 56. ,  nan,  1. ,  nan, 38. , 33. ,
       23. , 22. ,  nan, 34. , 29. , 22. ,  2. ,  9. ,  nan, 50. , 63. ,
       25. ,  nan, 35. , 58. , 30. ,  9. ,  nan, 21. , 55. , 71. , 21. ,
        nan, 54. ,  nan, 25. , 24. , 17. , 21. ,  nan, 37. , 16. , 18. ,
       33. ,  nan, 28. , 26. , 29. ,  nan, 36. , 54. , 24. , 47. , 34. ,
        nan, 36. , 32. , 30. , 22. ,  nan, 44. ,  nan, 40.5, 50. ,  nan,
       39. , 23. ,  2. ,  nan, 17. ,  nan, 30. ,  7. , 45. , 30. ,  nan,
       22. , 36. ,  9. , 11. , 32. , 50. , 64. , 19. ,  nan, 33. ,  8. ,
       17. , 27. ,  nan, 22. , 22. , 62. , 48. ,  nan, 39. , 36. ,  nan,
       40. , 28. ,  nan,  nan, 24. , 19. , 29. ,  nan, 32. , 62. , 53. ,
       36. ,  nan, 16. , 19. , 34. , 39. ,  nan, 32. , 25. , 39. , 54. ,
       36. ,  nan, 18. , 47. , 60. , 22. ,  nan, 35. , 52. , 47. ,  nan,
       37. , 36. ,  nan, 49. ,  nan, 49. , 24. ,  nan,  nan, 44. , 35. ,
       36. , 30. , 27. , 22. , 40. , 39. ,  nan,  nan,  nan, 35. , 24. ,
       34. , 26. ,  4. , 26. , 27. , 42. , 20. , 21. , 21. , 61. , 57. ,
       21. , 26. ,  nan, 80. , 51. , 32. ,  nan,  9. , 28. , 32. , 31. ,
       41. ,  nan, 20. , 24. ,  2. ,  nan,  1. , 48. , 19. , 56. ,  nan,
       23. ,  nan, 18. , 21. ,  nan, 18. , 24. ,  nan, 32. , 23. , 58. ,
       50. , 40. , 47. , 36. , 20. , 32. , 25. ,  nan, 43. ,  nan, 40. ,
       31. , 70. , 31. ,  nan, 18. , 24.5, 18. , 43. , 36. ,  nan, 27. ,
       20. , 14. , 60. , 25. , 14. , 19. , 18. , 15. , 31. ,  4. ,  nan,
       25. , 60. , 52. , 44. ,  nan, 49. , 42. , 18. , 35. , 18. , 25. ,
       26. , 39. , 45. , 42. , 22. ,  nan, 24. ,  nan, 48. , 29. , 52. ,
       19. , 38. , 27. ,  nan, 33. ,  6. , 17. , 34. , 50. , 27. , 20. ,
       30. ,  nan, 25. , 25. , 29. , 11. ,  nan, 23. , 23. , 28.5, 48. ,
       35. ,  nan,  nan,  nan, 36. , 21. , 24. , 31. , 70. , 16. , 30. ,
       19. , 31. ,  4. ,  6. , 33. , 23. , 48. ,  1. , 28. , 18. , 34. ,
       33. ,  nan, 41. , 20. , 36. , 16. , 51. ,  nan, 30.5,  nan, 32. ,
       24. , 48. , 57. ,  nan, 54. , 18. ,  nan,  5. ,  nan, 43. , 13. ,
       17. , 29. ,  nan, 25. , 25. , 18. ,  8. ,  1. , 46. ,  nan, 16. ,
        nan,  nan, 25. , 39. , 49. , 31. , 30. , 30. , 34. , 31. , 11. ,
        1. , 27. , 31. , 39. , 18. , 39. , 33. , 26. , 39. , 35. ,  6. ,
       30.5,  nan, 23. , 31. , 43. , 10. , 52. , 27. , 38. , 27. ,  2. ,
        nan,  nan,  1. ,  nan, 62. , 15. ,  1. ,  nan, 23. , 18. , 39. ,
       21. ,  nan, 32. ,  nan, 20. , 16. , 30. , 34.5, 17. , 42. ,  nan,
       35. , 28. ,  nan,  4. , 74. ,  9. , 16. , 44. , 18. , 45. , 51. ,
       24. ,  nan, 41. , 21. , 48. ,  nan, 24. , 42. , 27. , 31. ,  nan,
        4. , 26. , 47. , 33. , 47. , 28. , 15. , 20. , 19. ,  nan, 56. ,
       25. , 33. , 22. , 28. , 25. , 39. , 27. , 19. ,  nan, 26. , 32. ])

In [43]:
df['Age'].describe()

count    714.000000
mean      29.701681
std       14.521395
min        1.000000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [44]:
#ahora se cambiar el tipo de datos debido a que es flotante 
df['Age']=df['Age'].apply(lambda row:int(str(row).split('.')[0] )if '.' in str(row) else row) 
#este codigo convierte en str los datos de row con el split parte el str y dice que se quee conla parte izquierda [0]

In [45]:
df['Age'].unique() #

array([22., 38., 26., 35., nan, 54.,  2., 27., 14.,  4., 58., 20., 39.,
       55., 31., 34., 15., 28.,  8., 19., 40., 66., 42., 21., 18.,  3.,
        7., 49., 29., 65.,  5., 11., 45., 17., 32., 16., 25.,  1., 30.,
       33., 23., 24., 46., 59., 71., 37., 47., 70., 12.,  9., 36., 51.,
       44., 61., 56., 50., 62., 41., 52., 63., 43., 60., 10., 64., 13.,
       48., 53., 57., 80.,  6., 74.])

In [46]:
#hay otra forma de hacerlo
df['Age']=df['Age'].fillna(0)
df['Age']=df['Age'].astype(int)
df['Age'].replace(0,np.nan) 
#esta forma se puede hacer quitando los nan y es valida, pero en la vida real ouede tener algun problema

## test de granularidad: grueso o fino
si te vas a fijar el conjunto de datos o en una fila en concreto, es decir, grueso seria todo el conjunto de datos si es fina es algo mas concreto.